liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC39B/0_Src/AppSw/Tricore/DemoMcal/Demo_Irq/Stm_Irq/Stm_Irq.c
  #if (APP_SW == DEMO_APP)
  Dio_FlipChannel(DIO_CHANNEL_33_4);

  *Address_ptr_2 = STM0_TIM0.U;
  #endif /*#if (APP_SW == DEMO_APP)*/

  #if (WDG_DEMO_EN == STD_ON) && (WDG_17_SCU_TRIG_SELECT == WDG_17_SCU_STM_TIMER)
  /* Call Wdg periodic processing function */
  Mcu_17_Stm_CompareMatchIsr(0U, 0U); 

  *(volatile uint32 *)0xF0001040 = 0x01;/* clear interrupt iscr */
  
  #elif (APP_SW == TEST_APP)
  Test_Stm0Sr0_CompareMatchIsr();
  #endif
}
#endif
#endif
/******************************************************************************
** Syntax :          void STM0SR1_ISR(void)                                  **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       non reentrant                                           **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description :     Service on STM0 CM1 match interrupt                     **
**                                                                           **
******************************************************************************/
#if IRQ_STM0_SR1_TOS != IRQ_TOS_DMA
#if((IRQ_STM0_SR1_PRIO > 0) || (IRQ_STM0_SR1_CAT == IRQ_CAT2))
#if((IRQ_STM0_SR1_PRIO > 0) && (IRQ_STM0_SR1_CAT == IRQ_CAT1))
IFX_INTERRUPT(STM0SR1_ISR, 0, IRQ_STM0_SR1_PRIO)
#elif (IRQ_STM0_SR1_CAT == IRQ_CAT2)
ISR(STM0SR1_ISR)
#endif
{
  /* Enable Global Interrupts */
  ENABLE();  

  #if (APP_SW == TEST_APP)
  Test_Stm0Sr1_CompareMatchIsr();
  #endif /* #if (APP_SW == TEST_APP) */
}
#endif
#endif
#endif /*#if (IRQ_STM0_EXIST == STD_ON)*/


#if (IRQ_STM1_EXIST == STD_ON)
/******************************************************************************
** Syntax :          void STM1SR0_ISR(void)                                  **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       non reentrant                                           **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description :     Service on STM1 match interrupt                         **
**                                                                           **
******************************************************************************/
#if IRQ_STM1_SR0_TOS != IRQ_TOS_DMA
#if((IRQ_STM1_SR0_PRIO > 0) || (IRQ_STM1_SR0_CAT == IRQ_CAT2))
#if((IRQ_STM1_SR0_PRIO > 0) && (IRQ_STM1_SR0_CAT == IRQ_CAT1))
IFX_INTERRUPT(STM1SR0_ISR, 0, IRQ_STM1_SR0_PRIO)
#elif (IRQ_STM1_SR0_CAT == IRQ_CAT2)
ISR(STM1SR0_ISR)
#endif
{
  /* Enable Global Interrupts */
  ENABLE();

  #if(WDG_17_SCU_TRIG_SELECT == WDG_17_SCU_STM_TIMER) 
   Mcu_17_Stm_CompareMatchIsr(1U, 0U); 

  *(volatile uint32 *)0xF0001040 = 0x01;/* clear interrupt iscr */ 
  #endif
}
#endif
#endif

/******************************************************************************
** Syntax :          void STM1SR1_ISR(void)                                  **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       non reentrant                                           **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description :     Service on STM1 CM1 match interrupt                     **
**                                                                           **
******************************************************************************/
#if IRQ_STM1_SR1_TOS != IRQ_TOS_DMA
#if((IRQ_STM1_SR1_PRIO > 0) || (IRQ_STM1_SR1_CAT == IRQ_CAT2))
#if((IRQ_STM1_SR1_PRIO > 0) && (IRQ_STM1_SR1_CAT == IRQ_CAT1))
IFX_INTERRUPT(STM1SR1_ISR, 0, IRQ_STM1_SR1_PRIO)
#elif (IRQ_STM1_SR1_CAT == IRQ_CAT2)
ISR(STM1SR1_ISR)
#endif
{
  /* Enable Global Interrupts */
  ENABLE();
  

