liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/DemoWorkspace/McalDemo/TC39B/0_Src/AppSw/Tricore/DemoMcal/Demo_Irq/Stm_Irq/Stm_Irq.c
}
#endif
#endif
#endif /*#if (IRQ_STM1_EXIST == STD_ON)*/


#if (IRQ_STM2_EXIST == STD_ON)
/******************************************************************************
** Syntax :          void STM2SR0_ISR(void)                                  **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       non reentrant                                           **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description :     Service on STM2 match interrupt                         **
**                                                                           **
******************************************************************************/
#if IRQ_STM2_SR0_TOS != IRQ_TOS_DMA
#if((IRQ_STM2_SR0_PRIO > 0) || (IRQ_STM2_SR0_CAT == IRQ_CAT2))
#if((IRQ_STM2_SR0_PRIO > 0) && (IRQ_STM2_SR0_CAT == IRQ_CAT1))
IFX_INTERRUPT(STM2SR0_ISR, 0, IRQ_STM2_SR0_PRIO)
#elif (IRQ_STM2_SR0_CAT == IRQ_CAT2)
ISR(STM2SR0_ISR)
#endif
{
  /* Enable Global Interrupts */
  ENABLE();

  #if(WDG_17_SCU_TRIG_SELECT == WDG_17_SCU_STM_TIMER) 
   Mcu_17_Stm_CompareMatchIsr(2U, 0U); 

  *(volatile uint32 *)0xF0001040 = 0x01;/* clear interrupt iscr */ 
  #endif
}
#endif
#endif

/******************************************************************************
** Syntax :          void STM2SR1_ISR(void)                                  **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       non reentrant                                           **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description :     Service on STM2 CM1 match interrupt                     **
**                                                                           **
******************************************************************************/
#if IRQ_STM2_SR1_TOS != IRQ_TOS_DMA
#if((IRQ_STM2_SR1_PRIO > 0) || (IRQ_STM2_SR1_CAT == IRQ_CAT2))
#if((IRQ_STM2_SR1_PRIO > 0) && (IRQ_STM2_SR1_CAT == IRQ_CAT1))
IFX_INTERRUPT(STM2SR1_ISR, 0, IRQ_STM2_SR1_PRIO)
#elif (IRQ_STM2_SR1_CAT == IRQ_CAT2)
ISR(STM2SR1_ISR)
#endif
{
  /* Enable Global Interrupts */
  ENABLE();
  

}
#endif
#endif
#endif /*#if (IRQ_STM2_EXIST == STD_ON)*/


#if (IRQ_STM3_EXIST == STD_ON)
/******************************************************************************
** Syntax :          void STM3SR0_ISR(void)                                  **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       non reentrant                                           **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description :     Service on STM3 match interrupt                         **
**                                                                           **
******************************************************************************/
#if IRQ_STM3_SR0_TOS != IRQ_TOS_DMA
#if((IRQ_STM3_SR0_PRIO > 0) || (IRQ_STM3_SR0_CAT == IRQ_CAT2))
#if((IRQ_STM3_SR0_PRIO > 0) && (IRQ_STM3_SR0_CAT == IRQ_CAT1))
IFX_INTERRUPT(STM3SR0_ISR, 0, IRQ_STM3_SR0_PRIO)
#elif (IRQ_STM3_SR0_CAT == IRQ_CAT2)
ISR(STM3SR0_ISR)
#endif
{
  /* Enable Global Interrupts */
  ENABLE();

  #if(WDG_17_SCU_TRIG_SELECT == WDG_17_SCU_STM_TIMER) 
   Mcu_17_Stm_CompareMatchIsr(3U, 0U); 

  *(volatile uint32 *)0xF0001040 = 0x01;/* clear interrupt iscr */ 
  #endif
}
#endif
#endif

/******************************************************************************
** Syntax :          void STM3SR1_ISR(void)                                  **
**                                                                           **
** Service ID:       NA                                                      **
**                                                                           **
** Sync/Async:       Synchronous                                             **
**                                                                           **
** Reentrancy:       non reentrant                                           **
**                                                                           **
** Parameters (in):  none                                                    **
**                                                                           **
** Parameters (out): none                                                    **
**                                                                           **
** Return value:     none                                                    **
**                                                                           **
** Description :     Service on STM3 CM1 match interrupt                     **
**                                                                           **
******************************************************************************/
#if IRQ_STM3_SR1_TOS != IRQ_TOS_DMA
#if((IRQ_STM3_SR1_PRIO > 0) || (IRQ_STM3_SR1_CAT == IRQ_CAT2))
#if((IRQ_STM3_SR1_PRIO > 0) && (IRQ_STM3_SR1_CAT == IRQ_CAT1))
IFX_INTERRUPT(STM3SR1_ISR, 0, IRQ_STM3_SR1_PRIO)
#elif (IRQ_STM3_SR1_CAT == IRQ_CAT2)
ISR(STM3SR1_ISR)
#endif
{
  /* Enable Global Interrupts */
  ENABLE();
  
